Revit 2027 API
ScheduleDefinition.IsValidFieldIndex Method
 Checks whether an integer is a valid zero-based field index in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFieldIndex(
	int index
)
Public Function IsValidFieldIndex (
	index As Integer
) As Boolean
public:
bool IsValidFieldIndex(
	int index
)
member IsValidFieldIndex :
        index : int -> bool
Parameters
index Int32
 The field index to check.
Return Value
Boolean
 True if the field index is valid, false otherwise.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace